Repository: TableProApp/TablePro
Catalog: TablePro/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ko, tr, vi, zh_hans, zh_hant

source: The text could not be parsed as JSON. Use text mode to view or edit.
fr: Le texte n'a pas pu être analysé en JSON. Utilisez le mode texte pour le visualiser ou le modifier.
ko: 텍스트를 JSON으로 구문 분석할 수 없습니다. 텍스트 모드에서 보거나 편집하십시오.
tr: Metin JSON olarak ayrıştırılamadı. Görüntülemek veya düzenlemek için metin modunu kullanın.
vi: Không thể phân tích văn bản dưới dạng JSON. Dùng chế độ văn bản để xem hoặc chỉnh sửa.
zh_hans: 文本无法解析为 JSON。请使用文本模式查看或编辑。
zh_hant: 無法將文字剖析為 JSON。請使用文字模式檢視或編輯。

source: Apply suggested SQL?
fr: Appliquer SQL suggéré ?
ko: 제안된 SQL을 적용하시겠습니까?
tr: Önerilen SQL uygulansın mı?
vi: Áp dụng SQL được đề xuất?
zh_hans: 应用建议的 SQL？
zh_hant: 要套用建議的 SQL 嗎？

source: Enter an API key to load this provider's models.
fr: Entrez une clé API pour charger les modèles de ce fournisseur.

source: Apply Changes
fr: Appliquer les modifications
ko: 변경 사항 적용
tr: Değişiklikleri Uygula
vi: Áp dụng thay đổi
zh_hans: 应用更改
zh_hant: 套用變更

source: No Session Open
fr: Aucune session ouverte

source: Feedback submitted!
fr: Commentaires soumis !
ko: 피드백을 제출했습니다!
tr: Geri bildirim gönderildi!
vi: Đã gửi phản hồi!
zh_hans: 反馈已提交！
zh_hant: 意見回饋已送出！

source: Label
fr: Étiquette

source: Target table for SQL output when exporting a query
fr: Table cible pour l'affichage SQL lors de l'exportation d'une requête.
ko: 쿼리를 내보낼 때 SQL 출력의 대상 테이블
tr: Bir sorgu dışa aktarılırken SQL çıktısı için hedef tablo
vi: Bảng đích cho đầu ra SQL khi xuất một truy vấn
zh_hans: 导出查询时 SQL 输出的目标表
zh_hant: 匯出查詢時 SQL 輸出的目標資料表

source: Slow Queries
fr: Requêtes lentes
ko: 느린 쿼리
tr: Yavaş Sorgular
vi: Truy vấn chậm
zh_hans: 慢查询
zh_hant: 緩慢查詢

source: Open Project Folder…
fr: Ouvrir le dossier du projet...
ko: 프로젝트 폴더 열기…
tr: Proje Klasörünü Aç…
vi: Mở thư mục dự án…
zh_hans: 打开项目文件夹…
zh_hant: 開啟專案資料夾…

# Cannot create table %@: %@
source: Cannot create table %1$@: %2$@
fr: Impossible de créer la table %1$@ : %2$@

source: Add Command
fr: Ajouter un commande
ko: 명령 추가
tr: Komut Ekle
vi: Thêm lệnh
zh_hans: 添加命令
zh_hant: 新增指令

source: iCloud storage is full. Free up space in iCloud and try again.
fr: Le stockage iCloud est plein. Libérez de l'espace dans iCloud et réessayez.
ko: iCloud 저장 공간이 가득 찼습니다. iCloud에서 공간을 확보한 후 다시 시도하십시오.
tr: iCloud depolama alanı dolu. iCloud'da yer açıp yeniden deneyin.
vi: Dung lượng iCloud đã đầy. Hãy giải phóng dung lượng trong iCloud rồi thử lại.
zh_hans: iCloud 存储空间已满。请在 iCloud 中释放空间后重试。
zh_hant: iCloud 儲存空間已滿。請在 iCloud 中釋放空間後重試。

source: SSH private key not found: %@
fr: Clé privée SSH non trouvée : %@
ko: SSH 개인 키를 찾을 수 없습니다: %@
tr: SSH özel anahtarı bulunamadı: %@
vi: Không tìm thấy private key SSH: %@
zh_hans: 未找到 SSH 私钥：%@
zh_hant: 找不到 SSH 私密金鑰：%@

source: MCP Server
fr: Serveur MCP
ko: MCP 서버
tr: MCP Sunucusu
zh_hans: MCP 服务器
zh_hant: MCP 伺服器

source: The server is writing the file…
fr: Le serveur écrit le fichier...

source: AI Chat
fr: Chat IA
ko: AI 채팅
tr: Yapay Zeka Sohbeti
zh_hans: AI 对话
zh_hant: AI 對話

source: Import Failed
fr: Importation échouée
ko: 가져오기 실패
tr: İçe Aktarma Başarısız
vi: Nhập thất bại
zh_hans: 导入失败
zh_hant: 匯入失敗

source: Resume Query History
fr: Historique des requêtes de réintégration
ko: 쿼리 기록 재개
tr: Sorgu Geçmişini Sürdür
vi: Tiếp tục lịch sử truy vấn
zh_hans: 恢复查询历史
zh_hant: 繼續查詢歷史

source: Fold
fr: Plier
ko: 접기
tr: Katla
vi: Thu gọn
zh_hans: 折叠
zh_hant: 摺疊

source: Find Options
fr: Trouver des options

source: Table the tab shows
fr: Tableau que l'onglet montre
ko: 탭이 표시하는 테이블
tr: Sekmenin gösterdiği tablo
vi: Bảng mà tab đang hiển thị
zh_hans: 该标签页显示的表
zh_hant: 該標籤頁顯示的資料表

source: List stored procedures and user-defined functions in a schema.
fr: Liste des procédures stockées et des fonctions définies par l'utilisateur dans un schéma.
ko: 스키마의 저장 프로시저와 사용자 정의 함수를 나열합니다.
tr: Bir şemadaki saklı yordamları ve kullanıcı tanımlı fonksiyonları listeler.
vi: Liệt kê các stored procedure và hàm do người dùng định nghĩa trong một schema.
zh_hans: 列出某个 Schema 中的存储过程和用户自定义函数。
zh_hant: 列出某個綱要中的預存程序和使用者自訂函式。

source: Get detailed status of a database connection
fr: Obtenez un état détaillé d'une connexion à la base de données.
ko: 데이터베이스 연결의 상세 상태 가져오기
tr: Bir veritabanı bağlantısının ayrıntılı durumunu al
vi: Lấy trạng thái chi tiết của một kết nối cơ sở dữ liệu
zh_hans: 获取数据库连接的详细状态
zh_hant: 取得資料庫連線的詳細狀態

source: Quote character
fr: Caractère de citation
ko: 따옴표 문자
tr: Tırnak karakteri
vi: Ký tự trích dẫn
zh_hans: 引号字符
zh_hant: 引號字元

source: Removed
fr: Supprimé
ko: 제거됨
tr: Kaldırıldı
vi: Đã xóa
zh_hans: 移除
zh_hant: 移除

source: Failed to decompress .gz file
fr: Échec de la décompression du fichier .gz
ko: .gz 파일의 압축을 해제하지 못했습니다
tr: .gz dosyası açılamadı
vi: Giải nén tệp .gz thất bại
zh_hans: 解压 .gz 文件失败
zh_hant: 解壓縮 .gz 檔案失敗

source: INSERT Statement(s)
fr: INSÉRER(S) déclaration(s)
ko: INSERT 문
tr: INSERT İfade(si)
vi: Câu lệnh INSERT
zh_hans: INSERT 语句
zh_hant: INSERT 陳述式

source: Clear Query (⌘+Delete)
fr: Effacer la requête (⌘+Supprimer)
ko: 쿼리 지우기(⌘+Delete)
tr: Sorguyu Temizle (⌘+Delete)
vi: Xóa truy vấn (⌘+Delete)
zh_hans: 清除查询 (⌘+Delete)
zh_hant: 清除查詢 (⌘+Delete)

source: Open a table in TablePro and bring it forward. Returns once the tab exists, with the same tab id and window id that list_recent_tabs reports. Connects the connection if it is not open yet.
fr: Ouvrez une table dans TablePro et faites-la avancer. Elle revient une fois la barre d'onglets existante, avec le même identifiant de barre d'onglets et d'onglet que rapporté par list_recent_tabs. Elle se connecte si la connexion n'est pas encore ouverte.
ko: TablePro에서 테이블을 열고 앞으로 가져옵니다. 탭이 생기면 list_recent_tabs가 보고하는 것과 같은 탭 id 및 창 id와 함께 반환합니다. 연결이 아직 열려 있지 않으면 연결합니다.
tr: TablePro'da bir tablo açar ve öne getirir. Sekme oluştuğunda, list_recent_tabs'in bildirdiği sekme kimliği ve pencere kimliğiyle döner. Bağlantı henüz açık değilse bağlanır.
vi: Mở một bảng trong TablePro và đưa nó lên trước. Trả về ngay khi tab tồn tại, kèm đúng tab id và window id mà list_recent_tabs báo cáo. Sẽ kết nối nếu kết nối chưa mở.
zh_hans: 在 TablePro 中打开一张表并将其带到最前。标签页建立后即返回，带有与 list_recent_tabs 相同的标签页 id 和窗口 id。若连接尚未打开则会先连接。
zh_hant: 在 TablePro 中開啟一張資料表並將其帶到最前。標籤頁建立後即回傳，帶有與 list_recent_tabs 相同的標籤頁 id 和視窗 id。若連線尚未開啟則會先連線。

source: Nightly tables
fr: Tables nocturnes

source: on %@
fr: Sur %@
ko: %@에서
tr: %@ üzerinde
vi: trên %@
zh_hans: 在 %@ 上
zh_hant: 在 %@ 上

source: Changed %@.
fr: Modifié %@.

source: Role Attributes
fr: Attributs du rôle
ko: 역할 속성
tr: Rol Öznitelikleri
vi: Thuộc tính vai trò
zh_hans: 角色属性
zh_hant: 角色屬性

source: Selection
fr: Sélection
ko: 선택 영역
vi: Vùng chọn
zh_hans: 选区
zh_hant: 選取範圍

source: Maximum depth reached
fr: Profondeur maximale atteinte
ko: 최대 깊이에 도달했습니다
tr: Maksimum derinliğe ulaşıldı
vi: Đã đạt độ sâu tối đa
zh_hans: 已达到最大深度
zh_hant: 已達到最大深度

source: Verification Code Required
fr: Code de vérification requis
ko: 인증 코드 필요
tr: Doğrulama Kodu Gerekli
vi: Cần mã xác minh
zh_hans: 需要验证码
zh_hant: 需要驗證碼

source: Sidebar as Tree
fr: Barre latérale en arbre
ko: 트리형 사이드바
tr: Sidebar'ı Ağaç Olarak Göster
vi: Thanh bên dạng cây
zh_hans: 侧边栏显示为树状
zh_hant: 側邊欄顯示為樹狀

source: Active Provider
fr: Fournisseur actif
ko: 활성 프로바이더
tr: Aktif Sağlayıcı
vi: Nhà cung cấp đang hoạt động
zh_hans: 活动提供方
zh_hant: 使用中的供應商

source: Objects to export
fr: Objets à exporter

source: Move Word Right
fr: Déplacez le mot à droite
ko: 단어 단위로 오른쪽 이동
tr: Bir Kelime Sağa Git
vi: Sang phải một từ
zh_hans: 向右移动一个单词
zh_hant: 向右移動一個單字

source: Statements TablePro generated and ran
fr: Tableau de déclarations généré et exécuté par TablePro
ko: TablePro가 생성하고 실행한 명령문
tr: TablePro'nun ürettiği ve çalıştırdığı ifadeler
vi: Các câu lệnh mà TablePro đã tạo và chạy
zh_hans: TablePro 生成并运行的语句
zh_hant: TablePro 產生並執行的陳述式

source: Truncate Table
fr: Truncation de table
ko: 테이블 비우기
tr: Tabloyu Boşalt
vi: Truncate bảng
zh_hans: 清空表
zh_hant: 清空資料表

source: The version could not be restored: %@
fr: La version n'a pas pu être restaurée : %@

source: Enable AI Features
fr: Activer les fonctionnalités d'IA
ko: AI 기능 활성화
tr: AI Özelliklerini Etkinleştir
vi: Bật tính năng AI
zh_hans: 启用 AI 功能
zh_hant: 啟用 AI 功能

source: Dropping...
fr: En train de tomber...
ko: 삭제 중...
tr: Siliniyor...
vi: Đang xoá...
zh_hans: 正在删除…
zh_hant: 正在刪除…

source: Create a connection to get started
fr: Créez une connexion pour commencer.
ko: 시작하려면 연결을 생성하십시오
tr: Başlamak için bir bağlantı oluşturun
vi: Tạo kết nối để bắt đầu
zh_hans: 创建连接以开始使用
zh_hant: 建立連線以開始使用

source: User or role name
fr: Nom de l'utilisateur ou du rôle
ko: 사용자 또는 역할 이름
tr: Kullanıcı veya rol adı
vi: Tên người dùng hoặc vai trò
zh_hans: 用户或角色名称
zh_hant: 使用者或角色名稱

source: The Cloud SQL Auth Proxy did not become ready in time.
fr: Le Cloud SQL Auth Proxy n'est pas devenu prêt à temps.
ko: Cloud SQL Auth Proxy가 제한 시간 내에 준비되지 않았습니다.
tr: Cloud SQL Auth Proxy zamanında hazır olmadı.
vi: Cloud SQL Auth Proxy không sẵn sàng kịp thời.
zh_hans: Cloud SQL Auth Proxy 未能及时就绪。
zh_hant: Cloud SQL Auth Proxy 未能及時就緒。

source: Script generation cancelled.
fr: Génération de script annulée.
ko: 스크립트 생성이 취소되었습니다.
tr: Betik oluşturma iptal edildi.
vi: Đã hủy việc tạo script.
zh_hans: 已取消生成脚本。
zh_hant: 已取消產生指令稿。

source: Restore Previous Values…
fr: Restaurer les valeurs précédentes...
ko: 이전 값 복원…
tr: Önceki Değerleri Geri Yükle…
vi: Khôi phục giá trị trước đó…
zh_hans: 恢复之前的值…
zh_hant: 還原先前的值…

source: Toggle Query History
fr: Activer l'historique des requêtes
ko: 쿼리 기록 표시/숨기기
tr: Sorgu Geçmişini Aç/Kapat
vi: Bật/tắt lịch sử truy vấn
zh_hans: 切换查询历史
zh_hant: 切換查詢歷史

source: Next page
fr: Page suivante
ko: 다음 페이지
tr: Sonraki sayfa
vi: Trang sau
zh_hans: 下一页
zh_hant: 下一頁

source: View Full Changelog
fr: Voir le journal complet des modifications

source: The ssh-agent macOS runs, from SSH_AUTH_SOCK. 1Password and Secretive listen elsewhere.
fr: L'agent ssh macOS s'exécute, à partir de SSH_AUTH_SOCK. 1Password et Secretive écoutent ailleurs.

source: Tables with more estimated rows use approximate counts to avoid slow COUNT(*) queries
fr: Les tableaux contenant plus de lignes estimées utilisent des comptages approximatifs pour éviter des requêtes COUNT(*) lentes.
ko: 예상 행 수가 더 많은 테이블은 느린 COUNT(*) 쿼리를 피하기 위해 근삿값을 사용합니다
tr: Daha fazla tahmini satıra sahip tablolar, yavaş COUNT(*) sorgularından kaçınmak için yaklaşık sayımlar kullanır
vi: Các bảng có nhiều dòng ước tính sử dụng đếm xấp xỉ để tránh truy vấn COUNT(*) chậm
zh_hans: 估算行数较多的表使用近似计数以避免慢速 COUNT(*) 查询
zh_hant: 估算列數較多的資料表會使用近似計數,以避免緩慢的 COUNT(*) 查詢

source: Enter a name for this filter preset
fr: Entrez un nom pour ce paramètre de filtre prédéfini.
ko: 이 필터 프리셋의 이름을 입력하십시오
tr: Bu filtre ön ayarı için bir ad girin
vi: Nhập tên cho mẫu bộ lọc này
zh_hans: 输入此筛选预设的名称
zh_hant: 輸入此篩選預設組合的名稱

source: One result per statement
fr: Un résultat par déclaration
ko: 명령문마다 결과 하나
tr: İfade başına bir sonuç
vi: Mỗi câu lệnh một kết quả
zh_hans: 每条语句一个结果
zh_hant: 每條陳述式一個結果

source: Template
fr: Modèle
ko: 템플릿
vi: Mẫu
zh_hans: 模板
zh_hant: 範本

source: The secret manager did not return valid JSON.
fr: Le gestionnaire secret n'a pas renvoyé de JSON valide.
ko: 보안 정보 관리자가 유효한 JSON을 반환하지 않았습니다.
tr: Secret manager geçerli bir JSON döndürmedi.
vi: Trình quản lý secret không trả về JSON hợp lệ.
zh_hans: secret manager 未返回有效的 JSON。
zh_hant: secret manager 未回傳有效的 JSON。

source: Copy Diagnostic Info
fr: Copier les informations de diagnostic
ko: 진단 정보 복사
tr: Tanılama Bilgilerini Kopyala
vi: Sao chép thông tin chẩn đoán
zh_hans: 复制诊断信息
zh_hant: 複製診斷資訊

# Allow %@ on '%@'?
source: Allow %1$@ on '%2$@'?
fr: Permettre %1$@ sur '%2$@'?
ko: '%2$@'에서 %1$@을(를) 허용하시겠습니까?
tr: '%2$@' üzerinde %1$@ izni verilsin mi?
vi: Cho phép %1$@ trên '%2$@'?
zh_hans: 允许在 '%2$@' 上执行 %1$@ 吗？
zh_hant: 允許在 '%2$@' 上執行 %1$@ 嗎？

source: Copy rows into %@ on the server
fr: Copiez les lignes dans %@ sur le serveur.

source: Use the addresses the cluster advertises
fr: Utilisez les adresses annoncées par le cluster.
ko: 클러스터가 알리는 주소 사용
tr: Kümenin duyurduğu adresleri kullan
vi: Dùng các địa chỉ mà cụm quảng bá
zh_hans: 使用集群通告的地址
zh_hant: 使用叢集通告的位址

source: DuckLake Data Path
fr: Chemin de données DuckLake
ko: DuckLake 데이터 경로
tr: DuckLake Veri Yolu
vi: Đường dẫn dữ liệu DuckLake
zh_hans: DuckLake 数据路径
zh_hant: DuckLake 資料路徑

source: New Connection (⌘N)
fr: Nouvelle connexion (⌘N)
ko: 새 연결 (⌘N)
tr: Yeni Bağlantı (⌘N)
vi: Kết nối mới (⌘N)
zh_hans: 新建连接 (⌘N)
zh_hant: 新增連線 (⌘N)

source: The %@ line in ~/.ssh/config has a ${ with no closing brace.
fr: La ligne %@ dans ~/.ssh/config a un ${ sans parenthèses de fermeture.

source: The file holds a single value, not a list of rows.
fr: Le fichier contient une seule valeur, pas une liste de lignes.

source: Delete this column?
fr: Supprimer cette colonne ?
ko: 이 열을 삭제하시겠습니까?
tr: Bu sütun silinsin mi?
vi: Xóa cột này?
zh_hans: 删除此列？
zh_hant: 要刪除這個欄位嗎？

source: Installing…
fr: Installation en cours...
ko: 설치 중…
tr: Yükleniyor…
vi: Đang cài đặt…
zh_hans: 正在安装…
zh_hant: 安裝中…

source: %@ must be a whole number
fr: %@ doit être un nombre entier

source: Resolved on every connect. It stays on this Mac and never syncs, because it can name a command to run.
fr: Résolu à chaque connexion. Il reste sur ce Mac et ne se synchronise jamais, car il peut nommer une commande à exécuter.

source: Message too large. Shorten it and send it again.
fr: Message trop volumineux. Réduisez-le et envoyez-le à nouveau.

source: Count rows in a table. Without filters it returns the engine's fast estimate unless 'exact' is set; with filters it always counts for real.
fr: Compter les lignes d'une table. Sans filtres, il renvoie l'estimation rapide du moteur à moins que "exact" ne soit défini ; avec des filtres, il compte toujours pour de vrai.
ko: 테이블의 행 수를 셉니다. 필터가 없으면 'exact'를 설정하지 않는 한 엔진의 빠른 추정치를 반환하고, 필터가 있으면 항상 실제로 셉니다.
tr: Bir tablodaki satırları sayar. Filtre yoksa, 'exact' ayarlanmadıkça motorun hızlı tahminini döndürür; filtre varsa her zaman gerçekten sayar.
vi: Đếm số dòng trong một bảng. Không có bộ lọc thì trả về ước lượng nhanh của engine trừ khi đặt 'exact'; có bộ lọc thì luôn đếm thật.
zh_hans: 统计表中的行数。没有筛选条件时，除非设置了 'exact'，否则返回引擎的快速估算值；有筛选条件时始终真实统计。
zh_hant: 統計資料表中的列數。沒有篩選條件時，除非設定了 'exact'，否則回傳引擎的快速估算值；有篩選條件時一律真實統計。

source: Inactive
fr: Inactif
ko: 비활성
tr: Etkin Değil
vi: Không hoạt động
zh_hans: 非活跃
zh_hant: 非作用中

source: Sort direction (default ascending)
fr: Direction de tri (par défaut croissante)
ko: 정렬 방향(기본값 오름차순)
tr: Sıralama yönü (varsayılan artan)
vi: Hướng sắp xếp (mặc định tăng dần)
zh_hans: 排序方向（默认升序）
zh_hant: 排序方向（預設遞增）

source: Restore the previous values of rows you already saved. Saves are kept on this Mac for 7 days, encrypted, and never leave it.
fr: Restaurez les valeurs précédentes des lignes que vous avez déjà enregistrées. Les sauvegardes sont conservées sur ce Mac pendant 7 jours, cryptées et ne le quittent jamais.
ko: 이미 저장한 행의 이전 값을 복원합니다. 저장 기록은 이 Mac에 7일 동안 암호화되어 보관되며 밖으로 나가지 않습니다.
tr: Zaten kaydettiğiniz satırların önceki değerlerini geri yükler. Kayıtlar bu Mac'te 7 gün boyunca şifrelenmiş olarak tutulur ve buradan hiç çıkmaz.
vi: Khôi phục giá trị trước đó của các dòng bạn đã lưu. Các bản lưu được giữ trên máy Mac này trong 7 ngày, được mã hoá và không bao giờ rời khỏi máy.
zh_hans: 恢复你已经保存的那些行之前的值。保存记录在这台 Mac 上加密保留 7 天，且绝不外传。
zh_hant: 還原你已經儲存的那些列先前的值。儲存記錄在這台 Mac 上加密保留 7 天，且絕不外傳。

source: These rows came from another database than the one this tab is now using.
fr: Ces lignes proviennent d'une autre base de données que celle que cette onglet utilise actuellement.
ko: 이 행들은 이 탭이 현재 사용 중인 데이터베이스가 아닌 다른 데이터베이스에서 왔습니다.
tr: Bu satırlar, bu sekmenin şu anda kullandığından başka bir veritabanından geldi.
vi: Các dòng này đến từ một cơ sở dữ liệu khác với cơ sở dữ liệu mà tab này đang dùng.
zh_hans: 这些行来自与此标签页当前所用数据库不同的另一个数据库。
zh_hant: 這些列來自與此標籤頁目前所用資料庫不同的另一個資料庫。

source: Use Required for ClickHouse Cloud and other managed instances.
fr: Utilisé nécessaire pour ClickHouse Cloud et d'autres instances gérées.
ko: ClickHouse Cloud 및 기타 관리형 인스턴스에서는 Required를 사용하십시오.
tr: ClickHouse Cloud ve diğer yönetilen örnekler için Required kullanın.
vi: Dùng Required cho ClickHouse Cloud và các phiên bản được quản lý khác.
zh_hans: 对于 ClickHouse Cloud 和其他托管实例，请使用“必需”。
zh_hant: 對於 ClickHouse Cloud 和其他託管執行個體，請使用「必要」。

source: Size
fr: Taille
ko: 크기
tr: Boyut
vi: Kích thước
zh_hans: 大小
zh_hant: 大小

source: The dump is replayed into this database. Objects it names are overwritten and the change cannot be undone.
fr: Le déversement est répliqué dans cette base de données. Les objets qu'il nomme sont écrasés et le changement ne peut pas être annulé.

# Pre-connect script failed (exit %d): %@
source: Pre-connect script failed (exit %1$d): %2$@
fr: Échec du script de pré-connexion (sortir %1$d) : %2$@
ko: 연결 전 스크립트 실패(종료 코드 %1$d): %2$@
tr: Bağlantı öncesi betik başarısız (çıkış %d): %@
vi: Tập lệnh tiền kết nối thất bại (exit %d): %@
zh_hans: 连接前脚本失败（退出码 %d）：%@
zh_hant: 連線前指令稿失敗（退出碼 %1$d）：%2$@

source: Select images to attach
fr: Sélectionnez les images à joindre
ko: 첨부할 이미지 선택
tr: Eklenecek resimleri seçin
vi: Chọn ảnh để đính kèm
zh_hans: 选择要附加的图片
zh_hant: 選擇要附加的圖片

source: Change File…
fr: Changer le fichier...
ko: 파일 변경…
tr: Dosyayı Değiştir…
vi: Đổi tệp…
zh_hans: 更改文件…
zh_hant: 變更檔案…

source: Columns
fr: Colonnes
ko: 열
tr: Sütunlar
vi: Cột
zh_hans: 列
zh_hant: 欄位

source: Last query execution time
fr: Dernière exécution du temps de requête
ko: 마지막 쿼리 실행 시간
tr: Son sorgu çalıştırma süresi
vi: Thời gian thực thi truy vấn gần nhất
zh_hans: 上次查询执行时间
zh_hant: 上次查詢執行時間

source: Require SSL, skip verification
fr: Exiger SSL, sauter la vérification
ko: SSL 필수, 인증서 검증 건너뛰기
tr: SSL zorunlu, doğrulamayı atla
vi: Yêu cầu SSL, bỏ qua xác minh
zh_hans: 要求 SSL，跳过验证
zh_hant: 要求 SSL，略過驗證

source: Paste the JSON below and save
fr: Coller le JSON ci-dessous et enregistrer.
ko: 아래 JSON을 붙여넣고 저장하십시오
tr: Aşağıdaki JSON'u yapıştırın ve kaydedin
vi: Dán JSON dưới đây và lưu lại
zh_hans: 粘贴下方 JSON 并保存
zh_hant: 在下方貼上 JSON 並儲存

source: Cut
fr: Coupure
ko: 오려두기
tr: Kes
vi: Cắt
zh_hans: 剪切
zh_hant: 剪下

source: Click + to add a relationship between this table and another
fr: Cliquez + pour ajouter une relation entre cette table et une autre.
ko: +를 클릭하여 이 테이블과 다른 테이블 간의 관계를 추가하십시오
tr: Bu tablo ile başka bir tablo arasında ilişki eklemek için + tıklayın
vi: Nhấn + để thêm mối quan hệ giữa bảng này và bảng khác
zh_hans: 点击 + 添加此表与其他表之间的关系
zh_hant: 點按 + 以新增此資料表與另一個資料表之間的關聯

source: Skip
fr: Sauter
ko: 건너뛰기
vi: Bỏ qua
zh_hans: 跳过
zh_hant: 略過

source: String
fr: Chaîne
ko: 문자열
vi: Chuỗi
zh_hans: 字符串
zh_hant: 字串

source: The plugin isn't compatible with this version of TablePro. Update the app or reinstall the plugin.
fr: Le plugin n'est pas compatible avec cette version de TablePro. Mettez à jour l'application ou réinstallez le plugin.
ko: 이 플러그인은 현재 TablePro 버전과 호환되지 않습니다. 앱을 업데이트하거나 플러그인을 다시 설치하십시오.
tr: Eklenti bu TablePro sürümüyle uyumlu değil. Uygulamayı güncelleyin veya eklentiyi yeniden yükleyin.
vi: Plugin không tương thích với phiên bản TablePro này. Hãy cập nhật ứng dụng hoặc cài lại plugin.
zh_hans: 该插件与此版本的 TablePro 不兼容。请更新应用或重新安装插件。
zh_hant: 該外掛與此版本的 TablePro 不相容。請更新應用程式或重新安裝外掛。

source: The source reports no definition for it.
fr: La source ne rapporte aucune définition pour cela.

source: Custom Endpoint
fr: Point d'extrémité personnalisé
ko: 사용자 지정 엔드포인트
tr: Özel Uç Nokta
vi: Endpoint tùy chỉnh
zh_hans: 自定义端点
zh_hant: 自訂端點

source: %1$@/%2$@ rows
fr: %1$@/%2$@ lignes

source: Activate License
fr: Activer la licence
ko: 라이선스 활성화
tr: Lisansı Etkinleştir
vi: Kích hoạt giấy phép
zh_hans: 激活许可证
zh_hant: 啟用授權

source: Everything
fr: Tout
ko: 모두
tr: Her Şey
vi: Tất cả
zh_hans: 全部
zh_hant: 全部

source: Downloading…
fr: Téléchargement en cours...

source: No local port was free for the tunnel.
fr: Aucun port local n'était libre pour le tunnel.

source: Line break
fr: Fin d'alinéa
ko: 줄바꿈
tr: Satır sonu
vi: Xuống dòng
zh_hans: 换行
zh_hant: 換行

source: Open this query in a new tab and run it
fr: Ouvrez cette requête dans une nouvelle onglet et exécutez-la.
ko: 이 쿼리를 새 탭에서 열고 실행
tr: Bu sorguyu yeni bir sekmede açıp çalıştır
vi: Mở truy vấn này trong tab mới và chạy
zh_hans: 在新标签页中打开并运行此查询
zh_hant: 在新分頁中開啟並執行此查詢

source: Enable MCP Server
fr: Activer le serveur MCP
ko: MCP 서버 활성화
tr: MCP Sunucusunu Etkinleştir
vi: Bật MCP Server
zh_hans: 启用 MCP 服务器
zh_hant: 啟用 MCP 伺服器

source: License key, hidden
fr: Clé de licence, cachée
ko: 라이선스 키, 가려짐
tr: Lisans anahtarı, gizli
vi: Khóa giấy phép, đã ẩn
zh_hans: 许可证密钥，已隐藏
zh_hant: 授權金鑰，已隱藏

source: Form
fr: Forme

source: Remove Comment
fr: Supprimer le commentaire

source: Drop Foreign Table
fr: Déposer la table étrangère
ko: 외래 테이블 삭제
tr: Dış Tabloyu Sil
vi: Xóa Foreign Table
zh_hans: 删除外部表
zh_hant: 捨棄外部資料表

# Failed to fetch models from %@ (HTTP %d)
source: Failed to fetch models from %1$@ (HTTP %2$d)
fr: Échec de la récupération des modèles de %1$@ (HTTP %2$d)
ko: %1$@에서 모델을 가져오지 못했습니다 (HTTP %2$d)
tr: %@ adresinden modeller alınamadı (HTTP %d)
vi: Không thể tải danh sách mô hình từ %@ (HTTP %d)
zh_hans: 从 %@ 获取模型失败 (HTTP %d)
zh_hant: 從 %1$@ 取得模型失敗 (HTTP %2$d)

source: Providers
fr: Fournisseurs
ko: 제공자
vi: Nhà cung cấp
zh_hans: 提供商
zh_hant: 供應商

source: The list of allowed values is not carried over.
fr: La liste des valeurs autorisées n'est pas transmise.

source: %@ is invalid, so queries skip it and exports leave it out. Drop it, or rebuild it with REINDEX.
fr: %@ est invalide, donc les requêtes le sautaient et les exportations le laissaient de côté. Supprimez-le ou reconstruisez-le avec REINDEX.

source: Edit Metadata…
fr: Modifier les métadonnées...
ko: 메타데이터 편집…
tr: Meta Verileri Düzenle…
vi: Sửa siêu dữ liệu…
zh_hans: 编辑元数据…
zh_hant: 編輯中繼資料…

source: Deactivate on This Mac…
fr: Désactiver sur ce Mac...
ko: 이 Mac에서 비활성화…
tr: Bu Mac'te Devre Dışı Bırak…
vi: Hủy kích hoạt trên máy Mac này…
zh_hans: 在此 Mac 上停用…
zh_hant: 在此 Mac 上停用…

source: Incorrect passphrase
fr: Phrase de passe incorrecte
ko: 암호가 올바르지 않습니다
tr: Yanlış parola
vi: Cụm mật khẩu không đúng
zh_hans: 密码短语不正确
zh_hant: 密碼短語不正確

source: Apply only this filter
fr: Appliquer uniquement ce filtre
ko: 이 필터만 적용
tr: Yalnızca bu filtreyi uygula
vi: Chỉ áp dụng bộ lọc này
zh_hans: 仅应用此筛选
zh_hant: 僅套用這個篩選

source: This Month
fr: Ce mois-ci
ko: 이번 달
tr: Bu Ay
vi: Tháng này
zh_hans: 本月
zh_hant: 本月

source: Rename Failed
fr: Renommer échoué
ko: 이름 변경 실패
tr: Yeniden Adlandırma Başarısız
vi: Đổi tên thất bại
zh_hans: 重命名失败
zh_hant: 重新命名失敗

source: Default Port
fr: Port par défaut
ko: 기본 포트
tr: Varsayılan Port
vi: Cổng mặc định
zh_hans: 默认端口
zh_hant: 預設連接埠

source: Numeric tolerance
fr: Tolerance numérique
ko: 숫자 허용 오차
tr: Sayısal tolerans
vi: Dung sai số
zh_hans: 数值容差
zh_hant: 數值容差

source: Remove from Favorites
fr: Supprimer des favoris
ko: 즐겨찾기에서 제거
tr: Sık Kullanılanlardan Kaldır
vi: Gỡ khỏi Yêu thích
zh_hans: 从收藏中移除
zh_hant: 從收藏中移除

source: -- Once the rows are in
fr: -- Une fois les lignes en place

source: The driver cannot write an edited row.
fr: Le pilote ne peut pas écrire une ligne modifiée.

source: No rows returned
fr: Aucune ligne retournée
ko: 반환된 행 없음
tr: Satır döndürülmedi
vi: Không có dòng nào được trả về
zh_hans: 未返回任何行
zh_hant: 未傳回任何列

source: %@ cannot add or remove a table's indexes.
fr: %@ ne peut pas ajouter ni supprimer les index d’une table.

source: Sort Connections By
fr: Trier les connexions par

source: Account ID
fr: ID de compte
ko: 계정 ID
zh_hans: 账户 ID
zh_hant: 帳號 ID

source: Primary key references a column that does not exist: %@
fr: La clé primaire fait référence à une colonne qui n'existe pas : %@

source: Execute
fr: Exécuter
ko: 실행
tr: Çalıştır
vi: Thực thi
zh_hans: 执行
zh_hant: 執行
